-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Янв 20 2026 г., 09:03
-- Версия сервера: 8.0.30
-- Версия PHP: 8.1.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `db_books`
--

-- --------------------------------------------------------

--
-- Структура таблицы `Authors`
--

CREATE TABLE `Authors` (
  `Code_author` int NOT NULL,
  `name_author` varchar(50) DEFAULT NULL,
  `Birthday` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `Authors`
--

INSERT INTO `Authors` (`Code_author`, `name_author`, `Birthday`) VALUES
(1, 'Александр Беляев', '1884-03-16 00:00:00'),
(2, 'Александр Блок', '1880-11-28 00:00:00'),
(3, 'Александр Грибоедов', '1795-01-15 00:00:00'),
(4, 'Александр Грин', '1880-08-23 00:00:00'),
(5, 'Александр Дюма', '1802-07-24 00:00:00'),
(6, 'Александр Куприн', '1870-09-07 00:00:00'),
(7, 'Александр Островский', '1823-04-12 00:00:00'),
(8, 'Александр Пушкин', '1799-06-06 00:00:00'),
(9, 'Алексей Толстой', '1883-01-10 00:00:00'),
(10, 'Андрей Вознесенский', '1933-05-12 00:00:00'),
(11, 'Анна Ахматова', '1889-06-23 00:00:00'),
(12, 'Антон Чехов', '1860-01-29 00:00:00'),
(13, 'Антуан де Сент-Экзюпери', '1900-06-29 00:00:00'),
(14, 'Арсений Тарковский', '1907-06-25 00:00:00'),
(15, 'Артур Конан Дойл', '1859-05-22 00:00:00'),
(16, 'Афанасий Фет', '1820-05-12 00:00:00'),
(17, 'Борис Васильев', '1924-05-21 00:00:00'),
(18, 'Борис Пастернак', '1890-02-10 00:00:00'),
(19, 'Валентин Катаев', '1897-01-28 00:00:00'),
(20, 'Вениамин Каверин', '1902-04-19 00:00:00'),
(21, 'Владимир Высоцкий', '1938-01-25 00:00:00'),
(22, 'Владимир Гиляровский', '1855-12-08 00:00:00'),
(23, 'Владимир Маяковский', '1893-07-19 00:00:00'),
(24, 'Владимир Обручев', '1863-09-28 00:00:00'),
(25, 'Габриэль Гарсиа Маркес', '1927-03-06 00:00:00'),
(26, 'Даниель Дефо', '1660-09-13 00:00:00'),
(27, 'Джек Лондон', '1876-01-12 00:00:00'),
(28, 'Джордж Оруэлл', '1903-06-25 00:00:00'),
(29, 'Иван Бунин', '1870-10-22 00:00:00'),
(30, 'Иван Гончаров', '1812-06-18 00:00:00'),
(31, 'Иван Крылов', '1769-02-13 00:00:00'),
(32, 'Иван Тургенев', '1818-11-09 00:00:00'),
(33, 'Иоганн Вольфганг фон Гёте', '1749-08-28 00:00:00'),
(34, 'Кен Кизи', '1935-09-17 00:00:00'),
(35, 'Лев Толстой', '1828-09-09 00:00:00'),
(36, 'Марина Цветаева', '1892-10-08 00:00:00'),
(37, 'Михаил Булгаков', '1891-05-15 00:00:00'),
(38, 'Николай Гоголь', '1809-04-01 00:00:00'),
(39, 'Николай Некрасов', '1821-12-10 00:00:00'),
(40, 'Николай Чернышевский', '1828-07-24 00:00:00'),
(41, 'Осип Мандельштам', '1891-01-15 00:00:00'),
(42, 'Роберт Льюис Стивенсон', '1850-11-13 00:00:00'),
(43, 'Рэй Брэдбери', '1920-08-22 00:00:00'),
(44, 'Сергей Есенин', '1895-10-03 00:00:00'),
(45, 'Станислав Лем', '1921-09-12 00:00:00'),
(46, 'Уильям Шекспир', '1594-04-26 00:00:00'),
(47, 'Федор Достоевский', '1821-11-11 00:00:00'),
(48, 'Федор Тютчев', '1803-12-05 00:00:00'),
(49, 'Эрих Мария Ремарк', '1898-06-22 00:00:00'),
(50, 'Эрнест Хемингуэй', '1899-07-21 00:00:00'),
(51, 'Ярослав Гашек', '1883-04-30 00:00:00'),
(52, 'Виктор Гюго', '1802-02-26 00:00:00'),
(53, 'Михаил Булгаков', '1891-05-15 00:00:00'),
(54, 'Михаил Лермонтов', '1814-10-15 00:00:00'),
(55, 'Михаил Шолохов', '1905-05-24 00:00:00');

-- --------------------------------------------------------

--
-- Структура таблицы `Books`
--

CREATE TABLE `Books` (
  `Code_book` int NOT NULL,
  `Title_book` varchar(50) DEFAULT NULL,
  `Code_author` int DEFAULT NULL,
  `Pages` int DEFAULT NULL,
  `Code_publish` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `Books`
--

INSERT INTO `Books` (`Code_book`, `Title_book`, `Code_author`, `Pages`, `Code_publish`) VALUES
(1, 'Человек-амфибия', 1, 329, 903362),
(2, 'Голова профессора Доуэля', 1, 330, 903363),
(3, 'Стихотворения и поэмы', 2, 409, 903191),
(4, 'Горе от ума', 3, 348, 903947),
(5, 'Бегущая по волнам', 4, 421, 352183),
(6, 'Алые паруса', 4, 422, 352184),
(7, 'Граф Монте-Кристо', 5, 327, 903360),
(8, 'Олеся', 6, 413, 903359),
(9, 'Гранатовый браслет', 6, 414, 903360),
(10, 'Бесприданница', 7, 351, 352125),
(11, 'Стихотворения. Сказки. Поэмы', 8, 529, 352184),
(12, 'Евгений Онегин', 8, 593, 352189),
(13, 'Капитанская дочка', 8, 343, 903942),
(14, 'Дубровский', 8, 344, 903943),
(15, 'Повести Белкина', 8, 345, 903944),
(16, 'Хождение по мукам', 9, 832, 90142),
(17, 'Петр Первый', 9, 406, 94624),
(18, 'Стихотворения и поэмы', 10, 412, 903358),
(19, 'Стихотворения и поэмы', 11, 429, 352192),
(20, 'Повести и рассказы', 12, 326, 903359),
(21, 'Драма на охоте', 12, 355, 352128),
(22, 'Пьесы', 12, 356, 352129),
(23, 'Маленький принц', 13, 375, 352151),
(24, 'Стихотворения и поэмы', 14, 390, 352149),
(25, 'Приключения Шерлока Холмса', 15, 357, 352130),
(26, 'Возвращение Шерлока Холмса', 15, 358, 352131),
(27, 'Стихотворения. Поэмы', 16, 340, 903939),
(28, 'А зори здесь тихие', 17, 391, 352150),
(29, 'В списках не значился', 17, 392, 352151),
(30, 'Завтра была война', 17, 393, 352152),
(31, 'Доктор Живаго', 18, 332, 903931),
(32, 'Стихотворения и поэмы', 18, 424, 352186),
(33, 'Белеет парус одинокий', 19, 386, 352145),
(34, 'Два капитана', 20, 420, 352182),
(35, 'Стихотворения и песни', 21, 380, 352138),
(36, 'Москва и москвичи', 22, 335, 903934),
(37, 'Стихотворения и поэмы', 23, 372, 352148),
(38, 'Земля Санникова', 24, 415, 903361),
(39, 'Сто лет одиночества', 25, 383, 352141),
(40, 'Робинзон Крузо', 26, 399, 352153),
(41, 'Белый Клык', 27, 408, 903190),
(42, 'Мартин Иден', 27, 411, 352),
(43, '1984 Скотный двор', 28, 339, 903938),
(44, 'Стихотворения ', 29, 334, 903933),
(45, 'Темные аллеи', 29, 373, 352149),
(46, 'Жизнь Арсеньева', 29, 374, 352150),
(47, 'Обыкновенная история', 30, 321, 903190),
(48, 'Обломов', 30, 347, 903946),
(49, 'Басни', 31, 417, 352178),
(50, 'Ася', 32, 377, 267),
(51, 'Первая любовь', 32, 422, 86983),
(52, 'Записки охотника', 32, 314, 98147),
(53, 'Муму', 32, 315, 221),
(54, 'Отцы и дети', 32, 331, 86983),
(55, 'Рудин', 32, 418, 352179),
(56, 'Дворянское гнездо', 32, 419, 352181),
(57, 'Фауст', 33, 385, 352144),
(58, 'Над кукушкиным гнездом', 34, 426, 352189),
(59, 'Война и мир', 35, 336, 221),
(60, 'Анна Каренина', 35, 932, 98144),
(61, 'Воскресение', 35, 333, 903932),
(62, 'Хаджи-Мурат', 35, 376, 352152),
(63, 'Кавказский пленник', 35, 377, 352153),
(64, 'Казаки', 35, 378, 352134),
(65, 'Крейцерова соната', 35, 381, 352139),
(66, 'Отец Сергий', 35, 382, 352140),
(67, 'Детство. Отрочество. Юность', 35, 387, 352146),
(68, 'Севастопольские рассказы', 35, 388, 352147),
(69, 'Фальшивый купон', 35, 407, 903189),
(70, 'Стихотворения и поэмы ', 36, 323, 267),
(71, 'Мастер и Маргарита ', 37, 300, 91103),
(72, 'Собачье сердце', 37, 317, 223),
(73, 'Записки юного врача', 37, 318, 94623),
(74, 'Белая гвардия', 37, 346, 903945),
(75, 'Мертвые души ', 38, 664, 91103),
(76, 'Вечера на хуторе близ Диканьки', 38, 336, 903935),
(77, ' Миргород', 38, 337, 903936),
(78, 'Петербургские повести', 38, 341, 903940),
(79, 'Пьесы', 38, 342, 903941),
(80, 'Кому на Руси жить хорошо', 39, 367, 352142),
(81, 'Стихотворения. Поэмы', 39, 368, 352144),
(82, 'Что делать?', 40, 410, 267),
(83, 'Стихотворения', 41, 354, 352127),
(84, 'Остров сокровищ', 42, 428, 352191),
(85, '451° по Фаренгейту', 43, 361, 352134),
(86, 'Вино из одуванчиков', 43, 362, 352136),
(87, '451° по Фаренгейту', 43, 365, 352140),
(88, 'Вино из одуванчиков', 43, 366, 352141),
(89, 'Стихотворения и поэмы', 44, 319, 94624),
(90, 'Солярис', 45, 389, 352148),
(91, 'Ромео и Джульетта', 46, 400, 98147),
(92, 'Гамлет', 46, 401, 221),
(93, 'Король Лир', 46, 402, 222),
(94, 'Сонеты', 46, 404, 223),
(95, 'Преступление и наказание ', 47, 473, 352181),
(96, 'Братья Карамазовы', 47, 743, 93321),
(97, 'Идиот', 47, 316, 222),
(98, 'Записки из Мертвого дома', 47, 324, 352),
(99, 'Бесы', 47, 325, 903358),
(100, 'Униженные и оскорбленные', 47, 338, 903937),
(101, 'Записки из подполья', 47, 349, 352123),
(102, 'Двойник', 47, 369, 352145),
(103, 'Игрок', 47, 371, 352147),
(104, 'Бедные люди', 47, 395, 352153),
(105, 'Белые ночи', 47, 396, 352150),
(106, 'Неточка Незванова', 47, 397, 352151),
(107, 'Дядюшкин сон ', 47, 398, 352152),
(108, 'Село Степанчиково и его обитатели', 47, 405, 94623),
(109, 'Подросток', 47, 427, 352190),
(110, 'Стихотворения', 48, 328, 903361),
(111, 'Три товарища', 49, 322, 903191),
(112, 'Триумфальная арка', 49, 353, 352126),
(113, 'На западном фронте без перемен', 49, 384, 352142),
(114, 'Черный обелиск', 49, 416, 352177),
(115, 'Старик и море', 50, 350, 352124),
(116, 'По ком звонит колокол', 50, 370, 352146),
(117, 'Похождения бравого солдата Швейка', 51, 423, 352185),
(118, 'Отверженные', 52, 320, 903189),
(119, 'Собор Парижской Богоматери', 52, 394, 352153),
(120, 'Бег', 53, 425, 352187),
(121, 'Стихотворения. Поэмы', 54, 312, 98145),
(122, ' Герой нашего времени ', 54, 313, 98146),
(123, 'Донские рассказы', 55, 359, 352132),
(124, 'Судьба человека', 55, 360, 352133),
(125, 'Донские рассказы', 55, 363, 352138),
(126, 'Судьба человека', 55, 364, 352139),
(127, 'Тихий Дон', 55, 379, 352136);

-- --------------------------------------------------------

--
-- Структура таблицы `Deliveries`
--

CREATE TABLE `Deliveries` (
  `Code_delivery` int NOT NULL,
  `Name_delivery` varchar(50) DEFAULT NULL,
  `Name_company` varchar(50) DEFAULT NULL,
  `Address` varchar(100) DEFAULT NULL,
  `Phone` varchar(16) DEFAULT NULL,
  `INN` char(13) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `Deliveries`
--

INSERT INTO `Deliveries` (`Code_delivery`, `Name_delivery`, `Name_company`, `Address`, `Phone`, `INN`) VALUES
(1, 'ИП «Примак Ю.П.»', 'ИП «Примак Ю.П.»', 'Симферополь, ул. Кечкеметская, д.27', '89781459491', '010200020125'),
(2, 'ИП «Борисова Л.А.»', 'ИП «Борисова Л.А.»', 'Москва Комсомольская пл. 1а, стр 15, ск  15', '89167235223', '771500136123'),
(3, 'ИП НОВОСЕЛОВ', 'ИП НОВОСЕЛОВ', 'Москва, 1-й Павелецкий проезд,2 а', '84999135620', '771584254997'),
(4, 'ООО НЦ \"ЭНАС\"', 'ООО НЦ \"ЭНАС\"', 'Москва, Дербеневская набережная, дом 11', '84959136620', '000111002001'),
(5, 'АО \"Тверская Областная Типография\" ', 'АО \"Тверская Областная Типография\" ', 'Г ТВЕРЬ,ПЕРЕУЛОК СТУДЕНЧЕСКИЙ Д 28', '84822343138', '006950061549'),
(6, 'КНИЖНЫЙ СКЛАД', 'КНИЖНЫЙ СКЛАД', 'Белгород, Б.Хмельницкого пр., д.135 корп.1 эт.', '84722358878', '145789621021');

-- --------------------------------------------------------

--
-- Структура таблицы `Publishing_house`
--

CREATE TABLE `Publishing_house` (
  `Code_publish` int NOT NULL,
  `Publish` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `City` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `Publishing_house`
--

INSERT INTO `Publishing_house` (`Code_publish`, `Publish`, `City`) VALUES
(221, 'Memories', 'Москва'),
(222, 'Nota Bene', 'Москва'),
(223, 'Pubmix', 'Москва'),
(267, 'Аграф', 'Москва'),
(352, 'Азбука', 'Санкт-Петербург'),
(86983, 'Аквариум', 'Москва'),
(90142, 'Axioma', 'Санкт-Петербург'),
(91103, 'ABBYY Press', 'Москва'),
(93321, 'Ad Marginem', 'Москва'),
(94623, 'Абрис', 'Челябинск'),
(94624, 'Аванта+', 'Москва'),
(98144, 'EMERGENCY EXIT', 'Москва'),
(98145, 'Kolonna publications', 'Тверь'),
(98146, 'Livebook/Гаятри', 'Москва'),
(98147, 'Machina', 'Санкт-Петербург'),
(352123, 'Башкирское книжное издательство Китап', 'Уфа'),
(352124, 'Группа компаний Десяточка — издательство Белобережье', 'Брянск'),
(352125, 'Белые Альвы', 'Москва'),
(352126, 'Белый город', 'Москва'),
(352127, 'Бертельсманн Медиа Москау АО', 'Москва'),
(352128, 'Бест Бизнес Букс', 'Москва'),
(352129, 'Бином. Лаборатория знаний', 'Москва'),
(352130, 'БКИ', 'Екатеринбург'),
(352131, 'Большая Российская энциклопедия', 'Москва'),
(352132, 'ООО Книжный перекресток', 'Москва'),
(352133, 'БХВ-Петербург', 'Санкт-Петербург'),
(352134, 'Вагриус', 'Москва'),
(352136, 'Вако', 'Москва'),
(352138, 'Велигор', 'Москва'),
(352139, 'Вентана-Граф', 'Москва'),
(352140, 'Вербум-М', 'Москва'),
(352141, 'Вест-Консалтинг', 'Москва'),
(352142, 'Весь', 'Санкт-Петербург'),
(352144, 'Весь мир', 'Москва'),
(352145, 'Вече', 'Москва'),
(352146, 'Вешние воды', 'Орёл'),
(352147, 'Вильямс', 'Москва'),
(352148, 'Вита Нова', 'Санкт-Петербург'),
(352149, 'Владимир Даль', 'Санкт-Петербург'),
(352150, 'Владос', 'Москва'),
(352151, 'Водолей', 'Томск'),
(352152, 'Воениздат', 'Москва'),
(352153, 'Восток — Запад', 'Москва'),
(352154, 'Издательство Время', 'Москва'),
(352155, 'Вузовская книга', 'Москва'),
(352156, 'Высшая школа', 'Москва'),
(352157, 'Высшее образование', 'Москва'),
(352158, 'Ганга', 'Москва'),
(352159, 'Гардарики', 'Москва'),
(352160, 'Гелеос', 'Москва'),
(352161, 'Геликон Плюс', 'Санкт-Петербург'),
(352162, 'Генезис', 'Москва'),
(352163, 'Гео', 'Новосибирск'),
(352164, 'Гилея', 'Москва'),
(352165, 'Гиперион', 'Санкт-Петербург'),
(352166, 'Гиппо (Hippo Publishing Ltd)', 'Москва'),
(352168, 'Гнозис', 'Москва'),
(352169, 'Горбачёв-Фонд', 'Москва'),
(352170, 'Городец', 'Москва'),
(352171, 'Государственная публичная историческая библиотека', 'Москва'),
(352172, 'Гранд-ФАИР', 'Москва'),
(352173, 'ГроссМедиа Ферлаг', 'Москва'),
(352174, 'Издательский центр Гуманитарная Академия', 'Санкт-Петербург'),
(352175, 'ГЭОТАР-Медиа', 'Москва'),
(352176, 'ДАРЪ', 'Москва'),
(352177, 'Дашков и Ко', 'Москва'),
(352178, 'Издательство ДЕАН', 'Санкт-Петербург'),
(352179, 'Группа компаний Десяточка', 'Брянск'),
(352181, 'Детская литература', 'Москва'),
(352182, 'Диалектика', 'Москва'),
(352183, 'Директмедиа Паблишинг', 'Москва'),
(352184, 'Дмитрий Буланин', 'Санкт-Петербург'),
(352185, 'Добрая книга', 'Москва'),
(352186, 'Дом надежды', 'Москва'),
(352187, 'Дрофа', 'Москва'),
(352189, 'Евразия', 'Санкт-Петербург'),
(352190, 'Европа', 'Москва'),
(352191, 'Издательство Европейского Дома', 'Санкт-Петербург'),
(352192, 'Европейские издания', 'Москва'),
(352193, 'Захаров', 'Москва'),
(352194, 'Златоуст', 'Санкт-Петербург'),
(352195, 'Змей Горыныч', 'Москва'),
(352196, 'Знание', 'Москва'),
(352197, 'ФГУП Издательство Известия УДП РФ', 'Москва'),
(352198, 'Издательский Дом Панорама', 'Москва'),
(352199, 'Издательский Дом Регнум', 'Москва'),
(352200, 'Издательский Дом Мещерякова', 'Москва'),
(352201, 'Издательский Дом Мысль', 'Москва'),
(352202, 'Издательский дом Новости Югры', 'Ханты-Мансийск'),
(352204, 'издательства РАН', 'Москва'),
(352205, 'Издательство Вернера Регена', 'Санкт-Петербург'),
(352206, 'Издательство Ивана Лимбаха', 'Санкт-Петербург'),
(352207, 'Издательство МГУ', 'Москва'),
(352208, 'Издательство Российской национальной библиотеки', 'Москва'),
(352209, 'Издательство Санкт-Петербургского государственного университета (Unipress)', 'Санкт-Петербург'),
(352210, 'Издательство Сибирского Отделения Российской академии наук', 'Новосибирск'),
(352211, 'Импэто', 'Москва'),
(352212, 'ИНАПРЕСС', 'Санкт-Петербург'),
(352213, 'Индрик', 'Москва'),
(352214, 'Иностранка', 'Москва'),
(352215, 'Инфинити', 'Уфа'),
(352216, 'ИнформМед', 'Москва'),
(352217, 'Инфра-Инженерия', 'Москва'),
(352218, 'ИНФРА-М', 'Москва'),
(352219, 'ИРИСЭН', 'Москва'),
(352220, 'Искусство-Санкт-Петербург', 'Санкт-Петербург'),
(352221, 'ИТРК', 'Москва'),
(352222, 'Канон', 'Москва'),
(352223, 'Канон+', 'Москва'),
(352224, 'Карапуз', 'Москва'),
(352225, 'Каро', 'Санкт-Петербург'),
(352226, 'Издательский дом Кириллица', 'Брянск'),
(352227, 'Классика-XXI', 'Москва'),
(352228, 'Книжная палата', 'Москва'),
(352229, 'Книжный мир', 'Москва'),
(352230, 'Книжный сад', 'Москва'),
(352231, 'КноРус', 'Москва'),
(352232, 'КоЛибри', 'Москва'),
(352233, 'Издательский дом Коло', 'Санкт-Петербург'),
(352234, 'КолосС', 'Москва'),
(352235, 'Комикс', 'Москва'),
(352236, 'АО Комплект', 'Санкт-Петербург'),
(352237, 'Композитор', 'Москва'),
(352238, 'ЗАО Издательство „Композитор“ (Санкт-Петербург)', 'Санкт-Петербург'),
(352239, 'Коровакниги', 'Москва'),
(352240, 'Край Ра', 'Челябинск'),
(352241, 'Красный Матрос', 'Санкт-Петербург'),
(352242, 'Крылов', 'Санкт-Петербург'),
(352243, 'Культурная революция', 'Москва'),
(352244, 'Лабиринт', 'Москва'),
(352245, 'Научно-издательский центр „Ладомир“', 'Москва'),
(352246, 'Лань', 'Санкт-Петербург'),
(352247, 'Легион', 'Ростов-на-Дону'),
(352248, 'Лениздат', 'Санкт-Петербург'),
(352249, 'Летний сад', 'Москва'),
(352250, 'Лики России', 'Санкт-Петербург'),
(352251, 'Лимбус-Пресс', 'Санкт-Петербург'),
(352252, 'Линка-Пресс', 'Москва'),
(352253, 'ЛИСТОС', 'Иваново'),
(352254, 'Лицей', 'Саратов'),
(352255, 'Логос', 'Москва'),
(352256, 'ЛомоносовЪ', 'Москва'),
(352257, 'Лори', 'Москва'),
(352258, 'ЗАО Манн, Иванов и Фербер', 'Москва'),
(352260, 'МарТ', 'Ростов-на-Дону'),
(352261, 'Мартин', 'Москва'),
(352262, 'Махаон', 'Москва'),
(352263, 'Медицина', 'Москва'),
(352264, 'Медпрактика-М', 'Москва'),
(352265, 'Международные отношения', 'Москва'),
(352266, 'Мир', 'Москва'),
(352267, 'Мир и образование', 'Москва'),
(352268, 'Мир книги', 'Москва'),
(352270, 'Мирт', 'Санкт-Петербург'),
(352271, 'Мнемозина', 'Москва'),
(352272, 'МОЗАИКА-СИНТЕЗ', 'Москва'),
(352273, 'Молодая гвардия', 'Москва'),
(352274, 'Московский рабочий', 'Москва'),
(352275, 'Мысль', 'Москва'),
(352276, 'Наука', 'Москва'),
(352277, 'Нева', 'Санкт-Петербург'),
(352279, 'Ниола-пресс', 'Москва'),
(352280, 'Новое литературное обозрение', 'Москва'),
(352281, 'Новое издательство', 'Москва'),
(352282, 'Норма', 'Москва'),
(352283, 'Образование', 'Москва'),
(352284, 'ОГИ (Объединённое Гуманитарное Издательство)', 'Москва'),
(352285, 'ООО О-Краткое', 'Киров'),
(352286, 'Октопус', 'Москва'),
(352287, 'Олимп', 'Москва'),
(352288, 'Олимп-бизнес', 'Москва'),
(352289, 'ОЛМА Медиа Групп', 'Москва'),
(352290, 'Омега Пресс', 'Москва'),
(352291, 'Оникс', 'Москва'),
(352292, 'Остров', 'Санкт-Петербург'),
(352293, 'Открытые системы', 'Москва'),
(352294, 'Открытый мир', 'Москва'),
(352295, 'Пан пресс', 'Москва'),
(352296, 'Панорама (быв. изд-во ЦК КПСС Плакат)', 'Москва'),
(352297, 'Петербургское Востоковедение', 'Санкт-Петербург'),
(352298, 'Петроний', 'Санкт-Петербург'),
(352299, 'Издательский дом Питер', 'Санкт-Петербург'),
(352301, 'Планета', 'Москва'),
(352302, 'Издательство Санкт-ПетербургГПУ', 'Санкт-Петербург'),
(352303, 'Росмэн', 'Москва'),
(352304, 'Популярная литература', 'Москва'),
(352305, 'Правда / Пресса', 'Москва'),
(352306, 'Праксис', 'Москва'),
(352307, 'Практика', 'Москва'),
(352308, 'Прима Юнити', 'Москва'),
(352309, 'Прогресс', 'Москва'),
(352310, 'Прогресс-Традиция', 'Москва'),
(352311, 'Просвещение', 'Москва'),
(352312, 'Проспект', 'Москва'),
(352313, 'Проспект Науки', 'Санкт-Петербург'),
(352314, 'Профессия', 'Москва'),
(352315, 'Профессиональное издательство', 'Москва'),
(352316, 'Профиздат', 'Москва'),
(352317, 'Психотерапия', 'Москва'),
(352318, 'Радио и связь', 'Москва'),
(352319, 'Радиотехника', 'Москва'),
(352320, 'Радуга', 'Москва'),
(352321, 'Ренессанс', 'Москва'),
(352322, 'Республика', 'Москва'),
(352323, 'Ретро', 'Санкт-Петербург'),
(352324, 'Речь', 'Санкт-Петербург'),
(352325, 'Рипол-классик', 'Москва'),
(352326, 'Ровесник', 'Москва'),
(352327, 'Росмэн', 'Москва'),
(352328, 'Российское время', 'Москва'),
(352330, 'Росток', 'Санкт-Петербург'),
(352331, 'Русская панорама', 'Москва'),
(352332, 'Русская правда', 'Москва'),
(352333, 'Русский путь', 'Москва'),
(352335, 'Русский язык', 'Москва'),
(352336, 'Русское слово', 'Москва'),
(352337, 'РУССО', 'Москва'),
(352338, 'Сакура-пресс', 'Москва'),
(352339, 'Самовар', 'Москва'),
(352340, 'Самокат', 'Москва'),
(352341, 'Сварог и К', 'Москва'),
(352342, 'Свободное марксистское издательство', 'Москва'),
(352343, 'Сибирское университетское издательство', 'Новосибирск'),
(352344, 'Символ-Плюс', 'Санкт-Петербург'),
(352345, 'Симпозиум', 'Санкт-Петербург'),
(352346, 'ИТД Скифия', 'Санкт-Петербург'),
(352347, 'Славия', 'Санкт-Петербург'),
(352348, 'Слово', 'Москва'),
(352349, 'Смысл', 'Москва'),
(352350, 'Русская книга / Русская книга — XXI век', 'Москва'),
(352351, 'Советский писатель', 'Москва'),
(352352, 'Советский спорт', 'Москва'),
(352353, 'Советский художник / Галарт', 'Москва'),
(352354, 'Современник', 'Москва'),
(352355, 'Согласие', 'Москва'),
(352356, 'Сомбра', 'Москва'),
(352357, 'Социум', 'Челябинск'),
(352358, 'СпецЛит', 'Санкт-Петербург'),
(352359, 'Специальная Литература', 'Санкт-Петербург'),
(352360, 'Спорт и Культура', 'Москва'),
(352361, 'Стрекоза', 'Москва'),
(352362, 'Татарское книжное издательство', 'Казань'),
(352363, 'Текст', 'Москва'),
(352365, 'Терра', 'Москва'),
(352369, 'Терра Балтика', 'Калининград'),
(352370, 'Терра Фантастика', 'Москва'),
(352371, 'Территория будущего', 'Москва'),
(352372, 'Типолигон', 'Москва'),
(352373, 'Титул', 'Москва'),
(352374, 'Торнтон & Сагден', 'Москва'),
(352375, 'Трутень', 'Москва'),
(352376, 'Транспорт / Трансинфо', 'Москва'),
(352377, 'Удмуртия', 'Ижевск'),
(352378, 'Ультра. Культура', 'Екатеринбург'),
(352379, 'Университетская книга', 'Санкт-Петербург'),
(352380, 'Учитель', 'Волгоград'),
(352381, 'У-Фактория', 'Екатеринбург'),
(352382, 'Фабрика комиксов', 'Москва'),
(352383, 'Фантом-пресс', 'Москва'),
(352384, 'Феникс', 'Ростов-на-Дону'),
(352385, 'Физматкнига', 'Москва'),
(352386, 'Физматлит', 'Москва'),
(352387, 'Филологическое общество „СЛОВО“', 'Москва'),
(352388, 'Финансы и статистика', 'Москва'),
(352389, 'Финпресс', 'Москва'),
(352390, 'Фитон+', 'Москва'),
(352391, 'Фламинго', 'Москва'),
(352392, 'Флинта', 'Москва'),
(352393, 'Фонд Столярова', 'Москва'),
(352394, 'Фордевинд', 'Санкт-Петербург'),
(352395, 'Форум', 'Москва'),
(352396, 'Художественная литература', 'Москва'),
(352397, 'Центр Нарния', 'Москва'),
(352398, 'Центрполиграф', 'Москва'),
(352401, 'Чувашское книжное издательство', 'Чебоксары'),
(352402, 'Школьная Пресса', 'Москва'),
(352403, 'Эгмонт Россия', 'Москва'),
(352404, 'Эдиториал УРСС', 'Москва'),
(352407, 'Экзамен', 'Москва'),
(352410, 'Экономика', 'Москва'),
(352411, 'Экономистъ', 'Москва'),
(352412, 'Эксмо', 'Москва'),
(352414, 'Издательство Эллис Лак', 'Москва'),
(352415, 'ЭНАС', 'Москва'),
(352416, 'Эннеагон Пресс', 'Москва'),
(352417, 'Энциклопедия', 'Москва'),
(352418, 'Этерна', 'Москва'),
(352419, 'Ювента', 'Москва'),
(352420, 'Юнайтед Пресс', 'Москва'),
(352421, 'Юнипресс', 'Минск'),
(352422, 'ЮНИТИ', 'Минск'),
(352423, 'Юрайт', 'Минск'),
(352424, 'Юридическая литература', 'Минск'),
(352425, 'Юристъ', 'Минск'),
(352426, 'Языки славянской культуры', 'Москва'),
(352428, 'Яуза', 'Москва'),
(352429, 'Яхтсмен', 'Калининград'),
(903189, 'Аврора', 'Санкт-Петербург'),
(903190, 'Автограф века', 'Москва'),
(903191, 'Агра-Инрезерв', 'Москва'),
(903358, 'Ай Пи Эр Медиа', 'Саратов'),
(903359, 'Айрис-пресс', 'Москва'),
(903360, 'Академический проект', 'Москва'),
(903361, 'Академический проект', 'Санкт-Петербург'),
(903362, 'Издательский центр Академия', 'Москва'),
(903363, 'Академия Исследования Культуры', 'Санкт-Петербург'),
(903931, 'Алаборг', 'Санкт-Петербург'),
(903932, 'Алгоритм', 'Москва'),
(903933, 'Алетейя', 'Санкт-Петербург'),
(903934, 'Альва-Первая', 'Москва'),
(903935, 'Альпина Паблишер', 'Москва'),
(903936, 'Альфа-книга', 'Москва'),
(903937, 'Альфарет', 'Санкт-Петербург'),
(903938, 'Антология', 'Санкт-Петербург'),
(903939, 'Аркаим', 'Челябинск'),
(903940, 'АРКТИ', 'Москва'),
(903941, 'Арт-Родник', 'Москва'),
(903942, 'Аспект Пресс', 'Москва'),
(903943, 'АСТ-Пресс', 'Москва'),
(903944, 'Астрель-Санкт-Петербург', 'Санкт-Петербург'),
(903945, 'Аэтерна', 'Уфа'),
(903946, 'Баласс', 'Москва'),
(903947, 'Научное издательство Башкирская энциклопедия', 'Уфа');

-- --------------------------------------------------------

--
-- Структура таблицы `Purchases`
--

CREATE TABLE `Purchases` (
  `Code_purchase` int NOT NULL,
  `Code_book` int DEFAULT NULL,
  `Date_order` datetime DEFAULT NULL,
  `Code_delivery` int DEFAULT NULL,
  `Type_purchase` tinyint(1) DEFAULT NULL,
  `Cost` float DEFAULT NULL,
  `Amount` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `Purchases`
--

INSERT INTO `Purchases` (`Code_purchase`, `Code_book`, `Date_order`, `Code_delivery`, `Type_purchase`, `Cost`, `Amount`) VALUES
(1, 1, '2017-01-11 00:00:00', 1, 0, 112, 20),
(2, 2, '2017-01-17 00:00:00', 2, 0, 114, 22),
(3, 3, '2017-01-11 00:00:00', 3, 0, 116, 24),
(4, 4, '2017-01-29 00:00:00', 4, 0, 118, 100),
(5, 5, '2017-01-17 00:00:00', 5, 0, 120, 28),
(6, 6, '2017-02-10 00:00:00', 6, 0, 122, 30),
(7, 7, '2017-01-17 00:00:00', 2, 0, 124, 32),
(8, 8, '2017-02-10 00:00:00', 3, 0, 126, 34),
(9, 9, '2017-02-10 00:00:00', 4, 0, 128, 36),
(10, 10, '2017-02-10 00:00:00', 5, 0, 130, 38),
(11, 11, '2017-03-12 00:00:00', 6, 0, 132, 40),
(12, 12, '2017-03-18 00:00:00', 1, 0, 134, 42),
(13, 13, '2017-03-24 00:00:00', 2, 0, 136, 44),
(14, 14, '2017-03-30 00:00:00', 3, 0, 138, 46),
(15, 15, '2017-04-05 00:00:00', 4, 0, 140, 48),
(16, 16, '2017-04-11 00:00:00', 5, 0, 142, 50),
(17, 17, '2017-04-17 00:00:00', 6, 0, 144, 52),
(18, 18, '2017-04-23 00:00:00', 2, 0, 146, 54),
(19, 19, '2017-04-29 00:00:00', 3, 0, 148, 56),
(20, 20, '2017-05-05 00:00:00', 4, 0, 150, 58),
(21, 21, '2017-05-11 00:00:00', 1, 0, 152, 60),
(22, 22, '2017-05-17 00:00:00', 2, 0, 154, 62),
(23, 23, '2017-05-23 00:00:00', 3, 0, 156, 64),
(24, 24, '2017-05-29 00:00:00', 4, 0, 158, 66),
(25, 25, '2017-06-04 00:00:00', 5, 0, 160, 68),
(26, 26, '2017-06-10 00:00:00', 6, 0, 162, 70),
(27, 27, '2017-06-16 00:00:00', 2, 0, 164, 72),
(28, 28, '2017-06-22 00:00:00', 3, 0, 166, 74),
(29, 29, '2017-06-28 00:00:00', 4, 0, 168, 76),
(30, 30, '2017-07-04 00:00:00', 1, 0, 170, 78),
(31, 31, '2017-07-10 00:00:00', 2, 0, 172, 80),
(32, 32, '2017-07-16 00:00:00', 3, 0, 174, 82),
(33, 33, '2017-07-22 00:00:00', 4, 0, 176, 84),
(34, 34, '2017-07-28 00:00:00', 5, 0, 178, 86),
(35, 35, '2017-08-03 00:00:00', 6, 0, 180, 88),
(36, 36, '2017-08-09 00:00:00', 2, 0, 182, 90),
(37, 37, '2017-08-15 00:00:00', 3, 0, 184, 92),
(38, 38, '2017-08-21 00:00:00', 4, 0, 186, 94),
(39, 39, '2017-08-27 00:00:00', 5, 0, 188, 96),
(40, 40, '2017-09-02 00:00:00', 1, 0, 190, 98),
(41, 41, '2017-09-08 00:00:00', 2, 0, 192, 100),
(42, 42, '2017-09-14 00:00:00', 3, 0, 194, 102),
(43, 43, '2017-09-20 00:00:00', 4, 0, 196, 104),
(44, 44, '2017-09-26 00:00:00', 5, 0, 198, 106),
(45, 45, '2017-10-02 00:00:00', 6, 0, 200, 108),
(46, 46, '2017-10-08 00:00:00', 2, 0, 202, 110),
(47, 47, '2017-10-14 00:00:00', 3, 0, 204, 112),
(48, 48, '2017-10-20 00:00:00', 4, 0, 206, 114),
(49, 49, '2017-10-26 00:00:00', 5, 0, 208, 116),
(50, 50, '2017-11-01 00:00:00', 6, 0, 210, 118),
(51, 51, '2017-11-07 00:00:00', 1, 0, 212, 120),
(52, 52, '2017-11-13 00:00:00', 2, 0, 214, 122),
(53, 53, '2017-11-19 00:00:00', 3, 0, 216, 124),
(54, 54, '2017-11-25 00:00:00', 4, 0, 218, 126),
(55, 55, '2017-12-01 00:00:00', 5, 0, 220, 128),
(56, 56, '2017-12-07 00:00:00', 6, 0, 222, 130),
(57, 57, '2017-12-13 00:00:00', 2, 0, 224, 132),
(58, 58, '2017-12-19 00:00:00', 3, 0, 226, 134),
(59, 59, '2017-12-25 00:00:00', 4, 0, 228, 136),
(60, 60, '2017-12-31 00:00:00', 1, 0, 230, 138),
(61, 61, '2018-01-06 00:00:00', 2, 0, 232, 140),
(62, 62, '2018-01-12 00:00:00', 3, 0, 234, 142),
(63, 63, '2018-01-18 00:00:00', 4, 0, 236, 144),
(64, 64, '2018-01-24 00:00:00', 5, 0, 238, 146),
(65, 65, '2018-01-30 00:00:00', 6, 0, 240, 148),
(66, 66, '2018-02-05 00:00:00', 2, 0, 242, 150),
(67, 67, '2018-02-11 00:00:00', 3, 0, 244, 152),
(68, 68, '2018-02-17 00:00:00', 4, 0, 246, 154),
(69, 69, '2018-02-23 00:00:00', 1, 0, 248, 156),
(70, 70, '2018-03-01 00:00:00', 2, 0, 250, 158),
(71, 71, '2018-03-07 00:00:00', 3, 0, 252, 160),
(72, 72, '2018-03-13 00:00:00', 4, 0, 254, 162),
(73, 73, '2018-03-19 00:00:00', 5, 0, 256, 164),
(74, 74, '2018-03-25 00:00:00', 6, 0, 258, 166),
(75, 75, '2018-03-31 00:00:00', 1, 0, 260, 168),
(76, 76, '2018-04-06 00:00:00', 2, 0, 262, 170),
(77, 77, '2018-04-12 00:00:00', 3, 0, 264, 172),
(78, 78, '2018-04-18 00:00:00', 4, 0, 266, 174),
(79, 79, '2018-04-24 00:00:00', 5, 0, 268, 176),
(80, 80, '2018-04-30 00:00:00', 6, 0, 270, 178),
(81, 81, '2018-05-06 00:00:00', 2, 0, 272, 180),
(82, 82, '2018-05-12 00:00:00', 3, 0, 274, 182),
(83, 83, '2018-05-18 00:00:00', 4, 0, 276, 184),
(84, 84, '2018-05-24 00:00:00', 5, 0, 278, 186),
(85, 85, '2018-05-30 00:00:00', 6, 0, 280, 188),
(86, 86, '2018-06-05 00:00:00', 1, 0, 282, 190),
(87, 87, '2018-06-11 00:00:00', 2, 0, 284, 192),
(88, 88, '2018-06-17 00:00:00', 3, 0, 286, 194),
(89, 89, '2018-06-23 00:00:00', 4, 0, 288, 196),
(90, 90, '2018-06-29 00:00:00', 5, 0, 290, 198),
(91, 91, '2018-07-05 00:00:00', 6, 0, 292, 200),
(92, 92, '2018-07-11 00:00:00', 2, 0, 294, 202),
(93, 93, '2018-07-17 00:00:00', 3, 0, 296, 204),
(94, 94, '2018-07-23 00:00:00', 4, 0, 298, 206),
(95, 95, '2018-07-29 00:00:00', 1, 0, 300, 208),
(96, 96, '2018-08-04 00:00:00', 2, 0, 302, 210),
(97, 97, '2018-08-10 00:00:00', 3, 0, 304, 212),
(98, 98, '2018-08-16 00:00:00', 4, 0, 306, 214),
(99, 99, '2018-08-22 00:00:00', 5, 0, 308, 216),
(100, 100, '2018-08-28 00:00:00', 6, 0, 310, 218),
(101, 101, '2018-09-03 00:00:00', 2, 0, 312, 220),
(102, 102, '2018-09-09 00:00:00', 3, 0, 314, 222),
(103, 103, '2018-09-15 00:00:00', 4, 0, 316, 224),
(104, 104, '2018-09-21 00:00:00', 1, 0, 318, 226),
(105, 105, '2018-09-27 00:00:00', 2, 0, 320, 228),
(106, 106, '2018-10-03 00:00:00', 3, 0, 322, 230),
(107, 107, '2018-10-09 00:00:00', 4, 0, 324, 232),
(108, 108, '2018-10-15 00:00:00', 5, 0, 326, 234),
(109, 109, '2018-10-21 00:00:00', 6, 0, 328, 236),
(110, 110, '2018-10-27 00:00:00', 1, 0, 330, 238),
(111, 111, '2018-11-02 00:00:00', 2, 0, 332, 240),
(112, 112, '2018-11-08 00:00:00', 3, 0, 334, 242),
(113, 113, '2018-11-14 00:00:00', 4, 0, 336, 244),
(114, 114, '2018-11-20 00:00:00', 5, 0, 338, 246),
(115, 115, '2018-11-26 00:00:00', 6, 0, 340, 248),
(116, 116, '2018-12-02 00:00:00', 2, 0, 342, 250),
(117, 117, '2018-12-08 00:00:00', 3, 0, 344, 252),
(118, 118, '2018-12-14 00:00:00', 4, 0, 346, 254),
(119, 119, '2018-12-20 00:00:00', 5, 0, 348, 256),
(120, 120, '2018-12-26 00:00:00', 6, 0, 350, 258),
(121, 121, '2019-01-01 00:00:00', 1, 0, 352, 260),
(122, 122, '2019-01-07 00:00:00', 2, 0, 354, 262),
(123, 123, '2019-01-13 00:00:00', 3, 0, 356, 264),
(124, 124, '2019-01-19 00:00:00', 4, 0, 358, 266),
(125, 125, '2019-01-25 00:00:00', 5, 0, 360, 268),
(126, 126, '2019-01-31 00:00:00', 6, 0, 362, 270),
(127, 127, '2019-02-06 00:00:00', 2, 0, 364, 272);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `Authors`
--
ALTER TABLE `Authors`
  ADD PRIMARY KEY (`Code_author`);

--
-- Индексы таблицы `Books`
--
ALTER TABLE `Books`
  ADD PRIMARY KEY (`Code_book`),
  ADD KEY `Code_author` (`Code_author`),
  ADD KEY `Code_publish` (`Code_publish`);

--
-- Индексы таблицы `Deliveries`
--
ALTER TABLE `Deliveries`
  ADD PRIMARY KEY (`Code_delivery`);

--
-- Индексы таблицы `Publishing_house`
--
ALTER TABLE `Publishing_house`
  ADD PRIMARY KEY (`Code_publish`);

--
-- Индексы таблицы `Purchases`
--
ALTER TABLE `Purchases`
  ADD PRIMARY KEY (`Code_purchase`),
  ADD KEY `Code_book` (`Code_book`),
  ADD KEY `Code_delivery` (`Code_delivery`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `Authors`
--
ALTER TABLE `Authors`
  MODIFY `Code_author` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT для таблицы `Books`
--
ALTER TABLE `Books`
  MODIFY `Code_book` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=128;

--
-- AUTO_INCREMENT для таблицы `Deliveries`
--
ALTER TABLE `Deliveries`
  MODIFY `Code_delivery` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `Publishing_house`
--
ALTER TABLE `Publishing_house`
  MODIFY `Code_publish` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=903948;

--
-- AUTO_INCREMENT для таблицы `Purchases`
--
ALTER TABLE `Purchases`
  MODIFY `Code_purchase` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=128;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `Books`
--
ALTER TABLE `Books`
  ADD CONSTRAINT `books_ibfk_1` FOREIGN KEY (`Code_author`) REFERENCES `Authors` (`Code_author`),
  ADD CONSTRAINT `books_ibfk_2` FOREIGN KEY (`Code_publish`) REFERENCES `Publishing_house` (`Code_publish`);

--
-- Ограничения внешнего ключа таблицы `Purchases`
--
ALTER TABLE `Purchases`
  ADD CONSTRAINT `purchases_ibfk_1` FOREIGN KEY (`Code_book`) REFERENCES `Books` (`Code_book`),
  ADD CONSTRAINT `purchases_ibfk_2` FOREIGN KEY (`Code_delivery`) REFERENCES `Deliveries` (`Code_delivery`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
